app/views/courses/index.html.erb

	  <%= course.category.category %>
          <% course.locations.each do |location|  %>
---
SELECT "locations".* FROM "locations" INNER JOIN "courses_locations" ON "locations"."id" = "courses_locations"."location_id" WHERE "courses_locations"."course_id" = ?  [["course_id", 1]]