app/views/courses/new.html.erb

      <%= f.label :category %>
      <%= f.collection_check_boxes :category_ids, Category.all, :id, :category do |b| %>
---
SELECT "categories".* FROM "categories"

      <%= f.label :location %>
      <%= f.collection_check_boxes :location_ids, Location.all, :id, :location do |b| %>
---
SELECT "locations".* FROM "locations"