app/views/courses/show.html.erb

SELECT "locations".* FROM "locations" INNER JOIN "courses_locations" ON "locations"."id" = "courses_locations"."location_id" WHERE "courses_locations"."course_id" = ?  [["course_id", 1]]
---
<h4> Category: <%= link_to @course.category.category, course_path(:category => @course.category.category) %> </h4>
<h4> Location: <% @course.locations.each do |location| %>