app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "Full Stack Development"], ["created_at", "2019-05-17 02:45:45.729833"], ["updated_at", "2019-05-17 02:45:45.729833"]]