app/controllers/courses_controller.rb

SELECT "users".* FROM "users"
SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? LIMIT ?  [["category", "Web Development"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."category_id" = ? AND "courses"."category_id" = ?  [["category_id", 0], ["category_id", 0]]
SELECT  "locations".* FROM "locations" WHERE "locations"."location" = ? LIMIT ?  [["location", "14.10.31"], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."course_id" IN (SELECT "courses"."id" FROM "courses" WHERE "courses"."course_id" = ?)  [["course_id", 2]]
SELECT "locations".* FROM "locations" INNER JOIN "courses_locations" ON "locations"."id" = "courses_locations"."location_id" WHERE "courses_locations"."course_id" = ?  [["course_id", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."location" = ?  [["location", "14.10.31"]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" IN (?, ?, ?)  [["id", 1], ["id", 2], ["id", 3]]
---
  def index
    @users = User.all
    if params[:category]
      sth = Category.find_by(:category => params[:category])
      @courses = Course.where(:category_id => sth)

      @courses = Course.where(:category_id => sth.id)
    elsif params[:location]
      sth = Location.find_by(:location => params[:location])
      #a = Course.joins(:courses_locations).where
      @courses = Course.includes(:locations).where(locations: { id: sth })
     # @courses = Course.where(:course_id => a)
    else
      @courses = Course.all

INSERT INTO "courses" ("name", "user_id", "category_id", "created_at", "updated_at", "prerequisite", "desc") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "asd"], ["user_id", 3], ["category_id", 1], ["created_at", "2019-05-24 08:39:40.499998"], ["updated_at", "2019-05-24 08:39:40.499998"], ["prerequisite", "asd"], ["desc", "asd"]]
---
  def create
    @course = current_user.courses.build(course_params)
    respond_to do |format|
      if @course.save