app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)
    if @location.save
---
INSERT INTO "locations" ("location", "created_at", "updated_at") VALUES (?, ?, ?)  [["location", "14.10.30"], ["created_at", "2019-05-17 03:14:40.887284"], ["updated_at", "2019-05-17 03:14:40.887284"]]