app/views/layouts/_header.html.erb

SELECT "categories".* FROM "categories"
---
            <li><%= link_to "Show All", courses_path %></li>
            <% (Category.all).each do |cat| %>

SELECT "locations".* FROM "locations"
---
            <li><%= link_to "Show All", courses_path %></li>
            <% (Location.all).each do |loc| %>